In [3]:
dict1 ={"Name": ("Sejal" , "Ojal" ,  "Saachi" , "Sakshi","Darshi" , "Prachi" , "Nikhil" , "Neha", "Nishant" , "Renuka" ),
        "Marks":(50,54,60,45,69,78,67,54,33,67),
        "City":("Thane" , "Jalgaon" , "Karjat","Solapur","Nashik","Nagpur","Mumbai","Alibaugh","Surat","Ahemdabad")

}
print(dict1)

{'Name': ('Sejal', 'Ojal', 'Saachi', 'Sakshi', 'Darshi', 'Prachi', 'Nikhil', 'Neha', 'Nishant', 'Renuka'), 'Marks': (50, 54, 60, 45, 69, 78, 67, 54, 33, 67), 'City': ('Thane', 'Jalgaon', 'Karjat', 'Solapur', 'Nashik', 'Nagpur', 'Mumbai', 'Alibaugh', 'Surat', 'Ahemdabad')}

In [4]:
import pandas as pd

In [5]:
df=pd.DataFrame(dict1)

In [6]:
df.to_csv("ten.csv")

In [7]:
print(df)

      Name  Marks       City
0    Sejal     50      Thane
1     Ojal     54    Jalgaon
2   Saachi     60     Karjat
3   Sakshi     45    Solapur
4   Darshi     69     Nashik
5   Prachi     78     Nagpur
6   Nikhil     67     Mumbai
7     Neha     54   Alibaugh
8  Nishant     33      Surat
9   Renuka     67  Ahemdabad

In [8]:
df.describe()

           Marks
count  10.000000
mean   57.700000
std    13.233375
min    33.000000
25%    51.000000
50%    57.000000
75%    67.000000
max    78.000000

In [9]:
df.tail(2)

      Name  Marks       City
8  Nishant     33      Surat
9   Renuka     67  Ahemdabad

In [49]:
df.drop_duplicates()

      Name  Marks       City
0    Sejal     50      Thane
1     Ojal     54    Jalgaon
2   Saachi     60     Karjat
3   Sakshi     45    Solapur
4   Darshi     69     Nashik
5   Prachi     78     Nagpur
6   Nikhil     67     Mumbai
7     Neha     54   Alibaugh
8  Nishant     33      Surat
9   Renuka     67  Ahemdabad

In [51]:
df.min()

Name        Darshi
Marks           33
City     Ahemdabad
dtype: object

In [52]:
df.max

<bound method NDFrame._add_numeric_operations.<locals>.max of       Name  Marks       City
0    Sejal     50      Thane
1     Ojal     54    Jalgaon
2   Saachi     60     Karjat
3   Sakshi     45    Solapur
4   Darshi     69     Nashik
5   Prachi     78     Nagpur
6   Nikhil     67     Mumbai
7     Neha     54   Alibaugh
8  Nishant     33      Surat
9   Renuka     67  Ahemdabad>

In [53]:
df.mean

<bound method NDFrame._add_numeric_operations.<locals>.mean of       Name  Marks       City
0    Sejal     50      Thane
1     Ojal     54    Jalgaon
2   Saachi     60     Karjat
3   Sakshi     45    Solapur
4   Darshi     69     Nashik
5   Prachi     78     Nagpur
6   Nikhil     67     Mumbai
7     Neha     54   Alibaugh
8  Nishant     33      Surat
9   Renuka     67  Ahemdabad>

In [54]:
df.head()

     Name  Marks     City
0   Sejal     50    Thane
1    Ojal     54  Jalgaon
2  Saachi     60   Karjat
3  Sakshi     45  Solapur
4  Darshi     69   Nashik

In [11]:
df.iloc[1:3]

     Name  Marks     City
0   Sejal     50    Thane
1    Ojal     54  Jalgaon
2  Saachi     60   Karjat

In [58]:
df.Name

0      Sejal
1       Ojal
2     Saachi
3     Sakshi
4     Darshi
5     Prachi
6     Nikhil
7       Neha
8    Nishant
9     Renuka
Name: Name, dtype: object

In [59]:
df.Marks

0    50
1    54
2    60
3    45
4    69
5    78
6    67
7    54
8    33
9    67
Name: Marks, dtype: int64

In [60]:
df.City

0        Thane
1      Jalgaon
2       Karjat
3      Solapur
4       Nashik
5       Nagpur
6       Mumbai
7     Alibaugh
8        Surat
9    Ahemdabad
Name: City, dtype: object

In [61]:
print(df.dtypes)

Name     object
Marks     int64
City     object
dtype: object

In [62]:
df.count()

Name     10
Marks    10
City     10
dtype: int64

In [26]:
df.columns.tolist()

['Name', 'Marks', 'City']

In [67]:
df.sort_values

<bound method DataFrame.sort_values of       Name  Marks       City
0    Sejal     50      Thane
1     Ojal     54    Jalgaon
2   Saachi     60     Karjat
3   Sakshi     45    Solapur
4   Darshi     69     Nashik
5   Prachi     78     Nagpur
6   Nikhil     67     Mumbai
7     Neha     54   Alibaugh
8  Nishant     33      Surat
9   Renuka     67  Ahemdabad>

In [70]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [71]:
df.index.array

<PandasArray>
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
Length: 10, dtype: int64

In [17]:
df.groupby(by=["Marks"]).sum()

               Name             City
Marks
33          Nishant            Surat
45           Sakshi          Solapur
50            Sejal            Thane
54         OjalNeha  JalgaonAlibaugh
60           Saachi           Karjat
67     NikhilRenuka  MumbaiAhemdabad
69           Darshi           Nashik
78           Prachi           Nagpur

In [33]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    10 non-null     object
 1   Marks   10 non-null     int64
 2   City    10 non-null     object
dtypes: int64(1), object(2)
memory usage: 368.0+ bytes

In [34]:
df.nunique()

Name     10
Marks     8
City     10
dtype: int64

In [35]:
df.Marks.value_counts()

54    2
67    2
50    1
60    1
45    1
69    1
78    1
33    1
Name: Marks, dtype: int64

In [36]:
df.City.value_counts()

Thane        1
Jalgaon      1
Karjat       1
Solapur      1
Nashik       1
Nagpur       1
Mumbai       1
Alibaugh     1
Surat        1
Ahemdabad    1
Name: City, dtype: int64

In [37]:
df.Name.value_counts()

Sejal      1
Ojal       1
Saachi     1
Sakshi     1
Darshi     1
Prachi     1
Nikhil     1
Neha       1
Nishant    1
Renuka     1
Name: Name, dtype: int64

In [38]:
df.columns

Index(['Name', 'Marks', 'City'], dtype='object')

In [40]:
len(df)

10